// Quiz Creator;
function CQuiz(que, o1, o2, o3, o4, ans, d) {
	this.question = que;
	this.opt1 = o1;
	this.opt2 = o2;
	this.opt3 = o3;
	this.opt4 = o4;
	this.answer = ans;
	this.asked = d;
}

// Question 1
var q1 = new CQuiz(	
	'Як ви думаєте, за що відповідає менеджер проектів?',
	'За все в роботі, що безпосередньо повязано і не повязане з проектом.',
	'За результати роботи проектної команди, за прибуток, за взаємини з клієнтом і в команді',
	'За результати проекту: тобто, за виконання запланованих робіт в термін з дотриманням бюджету і уявлень замовника про якість.',
	'Нічого з вище наведеного',
	3,
	0
);

// Question 2
var q2 = new CQuiz(
	'Від чого справжній керівник проекту отримує задоволення в роботі?',
	'Від великих, масштабних, відкладених у часі результатів.',
	'Від швидких результатів: все повинно бути agile! Спринт - результат, спринт - результат.',
	'Від процесу.',
	'Нічого з вище наведеного',
	1,
	0
);

// Question 3
var q3 = new CQuiz(
	'У якому графіку ви готові працювати, керуючи проектними командами?',
	'24х7х365, інакше результату не домогтися.',
	'Хороший менеджер повинен все робити вчасно. В крайньому випадку, можна затриматися увечері, або вийти у вихідні за додаткову плату. Ну, і ще на обід ходити треба встигати.',
	'Менеджер проектів - це просто працівник, який  працює в рамках загальнокорпоративного розкладу, наприклад, з 09.00 до 18.00.',
	'Нічого з вище наведеного',
	2,
	0
);

// Question 4
var q4 = new CQuiz(
	'На керівнику проектів лежить велика відповідальність. А що це таке - відповідальність?',
	'Це готовність відповісти за наслідки будь-якої своєї дій і своєї бездіяльності',
	'Це самореалізація і готовність завжди робити більше. ',
	'Це виконання обіцянок і зобовязань. Коли все робиться вчасно, в рамках бюджету, з потрібною якістю',
	'Нічого з вище наведеного',
	3,
	0
);

// Question 5
var q5 = new CQuiz(
	'Як ви будете мотивувати свою команду?',
	'Матеріально: працівникові гроші ніколи не завадять.',
	'Буду використовувати нематеріальну мотивацію, переконавшись, що всі матеріальні зобовязання і умови по відношенню до учасників команди виконуються',
	'Нематеріальна мотивація - найкраща. Будемо займатися Командоутворення.',
	'Нічого з вище наведеного',
	2,
	0
);

// Question 6
var q6 = new CQuiz(
	'За що ви готові звільнити співробітника, який входить в вашу команду?',
	'Людина систематично порушує правила, за якими ведеться робота, а їх дотримання для результатів проекту дуже важливо.',
	'Людина постійно сперечається зі мною і ставить під сумнів в очах команди мій керівний авторитет.;',
	'Людина систематично не робить свою роботу і ставить під загрозу результати проекту. Все інше можна пережити.',
	'Нічого з вище наведеного',
	3,
	0
);

// Question 7
var q7 = new CQuiz(
	'Припустимо, що ваша команда досягла успіху: за день ви, несподівано, зробили етап, на який відводилася цілий тиждень, і у вас звільнилися чотири робочих дня. Що будете робити?',
	'Терміново будемо робити наступний пакет робіт за планом проекту. Напевно десь попереду нас чекає дуже непростий етап, і додатковий час нам дуже допоможе.',
	'У розслабленому режимі оцінимо майбутні роботи, і потихеньку почнемо робити найсмачніші шматочки. Це мотивує команду.',
	'Вирушимо по домівках і порадіємо позапланового чотириденного відпустці.',
	'Нічого з вище наведеного',
	1,
	0
);

// Question 8
var q8 = new CQuiz(
	'Ключовою член команди йде у планову відпустку саме в той момент, коли він дуже потрібен. Що будете робити?',
	'Постараюся переконати його залишитися: пообіцяю премію.',
	'Просто не пущу: проект важливіше будь-якого відпустки.',
	'Якщо я заздалегідь погодив відпустку, і все відбувається в рамках графіка відпусток, то відповідальності співробітника тут немає: нехай відпочиває. Будемо прориватися без нього.',
	'Нічого з вище наведеного',
	1,
	0
);

// Question 9
var q9 = new CQuiz(
	'На етапі планування чергового проекту стає очевидно, що людських ресурсів може не вистачити. Що ви будете робити?',
	'Постараємося домовитися про перерозподіл додаткового навантаження серед поточних учасників команди і підемо робити проект з такою кількістю людей, яке є.',
	'Подивимося, які етапи точно можна реалізувати малими силами і постараємося почати з них. А поки роботи йдуть - будемо терміново шукати людей',
	'Заблокую всі роботи, поки проектну команду не забезпечать ресурсами. Як ми без людей проект зробимо?',
	'Нічого з вище наведеного',
	3,
	0
);

// Question 10
var q10 = new CQuiz(
	'У проекті значну частину успіху забезпечує взаємодію з замовником. Як ви будете контролювати роботу команди замовника?',
	'Для цього треба проводити регулярні статус-репорти - наприклад, щотижневі. Якщо замовник не хоче окремо обговорювати свої результати - можна це повязати з статус-репорт команди виконавця',
	'Ніяк. Для цього є менеджер проекту з боку замовника',
	'Постараюся неформально отримувати потрібні відомості від учасників проекту з боку замовника',
	'Нічого з вище наведеного',
	1,
	0
);

// total question...
var totQ = [q1, q2, q3, q4, q5, q6, q7, q8, q9, q10];
